;;; code-0026.asm
;;; Demonstrating how to compute the arithmetic average using SSE/AVX
;;;
;;; Programmer: Mayer Goldberg, 2026

section .data
sample:
        dq 40.8781, 39.4805, 57.9506, 99.2832
        dq 72.3326, 47.7259, 60.7139, 38.9284
        dq 54.3306, 92.5317, 25.7033, 94.5752
        dq 40.2808, 62.8094, 64.3201, 21.5902
        dq 35.5367, 70.6876, 27.9659, 93.6828
        dq 98.2984, 78.9197, 50.7126, 24.3674
        dq 88.8176, 81.2694, 78.6387, 84.4927
        dq 46.8405, 37.5657, 49.4344, 31.8193
        dq 11.9792, 88.7191, 50.4452, 54.9542
        dq 45.7645, 35.9061, 87.5191, 51.7208
        dq 49.6613, 79.8551, 35.6506, 67.4143
        dq 31.6589, 67.1015, 52.2409, 48.4985
        dq 10.8702, 60.3187, 65.2419, 11.9179
        dq 86.5494, 69.3992, 95.6343, 38.9457
        dq 15.5069, 34.2624, 78.6828, 20.3425
        dq 15.9881, 58.1798, 26.8052, 82.2867
        dq 98.5116, 54.6404, 20.7818, 96.3389
        dq 14.6046, 13.5955, 81.6156, 78.4637
        dq 28.8693, 26.4101, 18.5849, 23.5057
        dq 67.9671, 31.3897, 45.8724, 97.7953
        dq 36.4482, 85.1586, 26.1192, 38.8874
        dq 94.1524, 50.8425, 70.8419, 65.9221
        dq 95.4083, 58.7586, 63.2649, 21.4259
        dq 31.1596, 87.7406, 65.9314, 64.3988
        dq 96.8942, 47.4426, 22.1219, 97.4994
        dq 57.3399, 50.8708, 66.2365, 36.2098
        dq 26.3673, 16.4719, 42.9514, 71.5653
        dq 26.7919, 92.6302, 25.7267, 30.6001
        dq 39.4775, 57.2097, 26.3235, 31.6893
        dq 72.1578, 32.6339, 36.4688, 87.9616
        dq 85.1997, 85.8152, 44.4489, 83.2171
        dq 25.3718, 34.5233, 16.2087, 26.3827
        dq 88.6597, 51.5385, 11.7916, 32.7978
        dq 87.3316, 98.7361, 35.3831, 70.1892
        dq 87.6416, 33.4545, 62.7418, 41.2252
        dq 41.2182, 55.2321, 71.3898, 35.3907
        dq 71.4443, 81.6679, 55.2032, 60.6856
N:
	dq ($ - sample) >> 3
fmt_output:
	db `𝑥̄̄ = %g\n\0`

section .bss

extern printf
global main
section .text
main:
	push rbp
	mov rbp, rsp
        and rsp, -16
        
	mov rcx, qword [N]
        shr rcx, 2
        mov rdx, 0
        vxorpd ymm0, ymm0, ymm0

.Loop:
        vmovupd ymm1, [sample + rdx]
        vaddpd ymm0, ymm0, ymm1
        add rdx, 8*4
        loopnz .Loop

        vextractf128 xmm1, ymm0, 1
        vaddpd xmm0, xmm0, xmm1
        movapd xmm1, xmm0
        unpckhpd xmm1, xmm1
        addsd xmm0, xmm1

        cvtsi2sd xmm1, qword [N]
        divsd xmm0, xmm1

        mov rdi, fmt_output
        mov rax, 1
        call printf

        mov rax, 0
	mov rsp, rbp
	pop rbp
	ret

section .note.GNU-stack noalloc noexec
